import React from 'react';
import '../assets/css/about.css';
import Dropdown from './modal/Dropdown';

const About = () => {


    const titleOne = ' মহিষাবান হিন্দু সোসাইটির কাজের বিবরণ: ';
  const titleTwo = 'মহিষাবান হিন্দু সোসাইটির নীতি সম্পর্কিত বিবরণ: ';
  const titleThree = 'মহিষাবান হিন্দু সোসাইটির গোপনীয়তা (Privacy):';
  const titleFour = 'কমিটি নির্বাচন প্রক্রিয়া:';

  const committeeElection = [
    {
      option: '১. সদস্যদের মনোনয়ন:',
      des: 'কমিটির বিভিন্ন পদে সদস্যদের মনোনীত করার সুযোগ থাকে। প্রতিটি সদস্য নিজে থেকে মনোনয়ন জমা দিতে পারে বা অন্য কোনো সদস্য তাকে মনোনীত করতে পারে। নির্বাচনের জন্য সভাপতি, সহ-সভাপতি, সাধারণ সম্পাদক, অর্থ সম্পাদকসহ অন্যান্য প্রয়োজনীয় পদে মনোনয়ন গ্রহণ করা হয়।',
    },
    {
      option: '২. প্রার্থীদের প্রচারণা:',
      des: 'নির্বাচনে অংশগ্রহণকারী প্রার্থীরা নিজেদের লক্ষ্য, কর্মপরিকল্পনা, এবং সংগঠনের উন্নয়নে তাদের ভূমিকা নিয়ে প্রচারণা চালাতে পারেন। এটি সদস্যদের প্রার্থীদের যোগ্যতা মূল্যায়নে সহায়তা করে।',
    },
    {
      option: '৩. ভোটগ্রহণ:',
      des: 'নির্দিষ্ট দিনে ভোটগ্রহণ অনুষ্ঠিত হয়, যেখানে সংগঠনের প্রত্যেক যোগ্য সদস্য তাদের ভোট প্রদান করতে পারেন। ভোট গোপন ব্যালটের মাধ্যমে নেওয়া হয়, যা নিশ্চিত করে যে প্রত্যেক ভোটার নির্ভয়ে তাদের পছন্দের প্রার্থীকে ভোট দিতে পারেন।',
    },
    {
      option: '৪. ফলাফল ঘোষণা:',
      des: 'ভোটগ্রহণ শেষে ভোট গণনা করা হয় এবং ফলাফল স্বচ্ছভাবে ঘোষণা করা হয়। যেসব প্রার্থী সর্বাধিক ভোট পান, তারা সংগঠনের নতুন কমিটিতে নির্বাচিত হন।',
    },
    {
      option: '৫. পদ গ্রহণ এবং কার্যক্রম শুরু:',
      des: 'নির্বাচিত কমিটি তাদের দায়িত্ব গ্রহণ করে এবং সংগঠনের কার্যক্রম পরিচালনা শুরু করে। তারা সংগঠনের লক্ষ্যমাত্রা এবং পরিকল্পনা অনুযায়ী পরবর্তী সময়ের জন্য কার্যক্রম পরিচালনা করে।',
    },
    {
      option: '৬. স্বচ্ছতা ও জবাবদিহিতা:',
      des: 'কমিটি নির্বাচন প্রক্রিয়ায় স্বচ্ছতা বজায় রাখা হয় এবং সকল সদস্যদের অংশগ্রহণ নিশ্চিত করা হয়। নির্বাচনের পরে নতুন কমিটি সংগঠনের সদস্যদের প্রতি জবাবদিহি থেকে কাজ করে এবং সংগঠনের উন্নয়নে কার্যকর ভূমিকা পালন করে।',
    },
  ];

  
  const privacyPolicy = [
    {
      option: '১. ব্যক্তিগত তথ্যের সুরক্ষা:',
      des: 'মহিষাবান হিন্দু সোসাইটি তার সদস্যদের ব্যক্তিগত তথ্যের গোপনীয়তা রক্ষা করে। সংগঠনের কার্যক্রমের জন্য প্রয়োজনীয় তথ্য ব্যতীত অন্য কোনো ব্যক্তিগত তথ্য তৃতীয় পক্ষের সাথে ভাগ করা হয় না।',
    },
    {
      option: '২. তথ্য সংগ্রহ ও ব্যবহার:',
      des: 'সোসাইটি শুধুমাত্র তার সদস্যদের থেকে সংগঠনের কার্যক্রম পরিচালনার জন্য প্রয়োজনীয় তথ্য সংগ্রহ করে। এ তথ্যগুলো শুধুমাত্র সংগঠনের অভ্যন্তরীণ কাজ এবং সদস্যদের সাথে যোগাযোগের জন্য ব্যবহার করা হয়।',
    },
    {
      option: '৩. তৃতীয় পক্ষের সাথে তথ্য শেয়ারিং:',
      des: 'সংগঠনের সদস্যদের সম্মতি ছাড়া তাদের ব্যক্তিগত তথ্য তৃতীয় পক্ষের সাথে ভাগ করা হবে না, যদি না তা আইনগত কারণে প্রয়োজন হয়।',
    },
    {
      option: '৪. গোপনীয়তা রক্ষা করার প্রতিশ্রুতি:',
      des: 'সোসাইটি তার সদস্যদের তথ্যের গোপনীয়তা এবং সুরক্ষা বজায় রাখতে প্রতিশ্রুতিবদ্ধ। কোনো ধরনের তথ্যের অপব্যবহার বা অপ্রয়োজনীয় প্রকাশ থেকে সুরক্ষা নিশ্চিত করা হয়।',
    },
    {
      option: '৫. কুকি এবং ট্র্যাকিং:',
      des: 'সোসাইটি তার ওয়েবসাইটের কার্যক্ষমতা উন্নত করতে এবং সদস্যদের অভিজ্ঞতা আরও উন্নত করার জন্য কুকি এবং অন্যান্য ট্র্যাকিং টেকনোলজি ব্যবহার করতে পারে। যেসব ব্যবহারকারী কুকি গ্রহণ করতে চান না, তারা তাদের ব্রাউজার সেটিংস থেকে তা নিষ্ক্রিয় করতে পারবেন।',
    },
    {
      option: '৬. তথ্যের সঠিকতা ও আপডেট:',
      des: 'সোসাইটি তার সদস্যদের ব্যক্তিগত তথ্য সঠিক এবং আপডেট রাখা নিশ্চিত করার জন্য কাজ করে। সদস্যদের যে কোনো তথ্য পরিবর্তন বা আপডেট করার জন্য যথাসময়ে সোসাইটিকে অবহিত করা উচিত।',
    },
    {
      option: '৭. তথ্য অ্যাক্সেস এবং পরিবর্তন:',
      des: 'সদস্যরা তাদের ব্যক্তিগত তথ্য অ্যাক্সেস করতে এবং সোসাইটির সাথে থাকা তথ্য পরিবর্তন বা আপডেট করতে পারবেন। সদস্যরা তাদের তথ্য সংশোধনের জন্য সরাসরি অনুরোধ জানাতে পারেন।',
    },
    {
      option: '৮. ডাটা রিটেনশন:',
      des: 'সোসাইটি শুধুমাত্র প্রয়োজনীয় সময় পর্যন্ত সদস্যদের ব্যক্তিগত তথ্য সংরক্ষণ করে। সদস্যদের কোনো ব্যক্তিগত তথ্য সংরক্ষণের প্রয়োজন ফুরিয়ে গেলে তা নিরাপদে মুছে ফেলা হয়।',
    },
  ];


  const workDesTwo = [
    {
      option: '১. সমাজের সেবা:',
      des: 'মহিষাবান হিন্দু সোসাইটি হিন্দু ধর্মীয় ও সাংস্কৃতিক মূল্যবোধ সংরক্ষণে প্রতিশ্রুতিবদ্ধ। সংগঠনটি সামাজিক উন্নয়নে, সমাজের বিভিন্ন স্তরের মানুষের মধ্যে সম্প্রীতি, ঐক্য, ও নৈতিকতার বার্তা ছড়িয়ে দিতে কাজ করে।',
    },
    {
      option: '২. সমান সুযোগ:',
      des: 'সকল সদস্য এবং অংশগ্রহণকারীদের জন্য সমান সুযোগ নিশ্চিত করা হয়। ধর্ম, বর্ণ, লিঙ্গ, বা সামাজিক স্তরের ভিত্তিতে কোনো বৈষম্য বা পক্ষপাতিত্ব করা হয় না।',
    },
    {
      option: '৩. স্বচ্ছতা ও জবাবদিহিতা:',
      des: 'সংগঠনটি তার আর্থিক লেনদেন, কার্যক্রম এবং সিদ্ধান্ত গ্রহণের প্রক্রিয়ায় স্বচ্ছতা বজায় রাখে। সদস্যদের দায়িত্বশীল আচরণ এবং সংগঠনের কাজের প্রতি জবাবদিহিতা নিশ্চিত করা হয়।',
    },
    {
      option: '৪. নৈতিকতা ও মূল্যবোধ:',
      des: 'সংগঠনের প্রতিটি কার্যক্রমের সময় উচ্চ নৈতিক মান বজায় রাখার উপর গুরুত্ব দেওয়া হয়। হিন্দু ধর্মের মূল নীতিমালা এবং সমাজের সার্বিক উন্নয়নে অবদান রাখার প্রচেষ্টা করা হয়।',
    },
  ];

  
  const workDes = [
        {
          option: '১. ধর্মীয় অনুষ্ঠান ও আচার পালন:',
          des: 'সংগঠনটি বিভিন্ন হিন্দু ধর্মীয় উৎসব ও আচার-অনুষ্ঠান পালন করে। এর মধ্যে দুর্গাপূজা, কালীপূজা, সরস্বতী পূজা, রথযাত্রা, এবং অন্যান্য উৎসব অন্তর্ভুক্ত। এই আচার-অনুষ্ঠানের মাধ্যমে ধর্মীয় ঐতিহ্য ও মূল্যবোধকে নতুন প্রজন্মের কাছে পৌঁছে দেওয়া হয়।',
        },
        {
          option: '২. সাংস্কৃতিক কার্যক্রম:',
          des: 'মহিষাবান হিন্দু সোসাইটি নিয়মিতভাবে সাংস্কৃতিক অনুষ্ঠানের আয়োজন করে, যার মধ্যে রয়েছে নৃত্য, সংগীত, নাটক এবং চিত্রাংকন প্রতিযোগিতা। এর মাধ্যমে হিন্দু সংস্কৃতি ও ঐতিহ্যকে জীবন্ত রাখা এবং সমাজে সংস্কৃতির গুরুত্বকে তুলে ধরা হয়।',
        },
        {
          option: '৩. সমাজসেবা ও দান কর্মসূচি:',
          des: 'সংগঠনটি বিভিন্ন সমাজসেবামূলক কার্যক্রম পরিচালনা করে, যেমন দরিদ্র ও অসহায় মানুষদের খাদ্য বিতরণ, চিকিৎসা সহায়তা প্রদান, এবং শিক্ষামূলক কার্যক্রম পরিচালনা। এর মাধ্যমে সোসাইটি সমাজের প্রয়োজনীয় মানুষদের সহায়তা করে।',
        },
        {
          option: '৪. ধর্মীয় শিক্ষা ও সচেতনতা বৃদ্ধি:',
          des: 'মহিষাবান হিন্দু সোসাইটি হিন্দু ধর্মীয় শিক্ষার প্রচার করে এবং শিশুদের ও তরুণদের জন্য ধর্মীয় ক্লাসের আয়োজন করে। এতে ধর্মীয় বইপাঠ, গীতা ও অন্যান্য ধর্মগ্রন্থের শিক্ষা অন্তর্ভুক্ত থাকে।',
        },
        {
          option: '৫. ঐক্য ও সম্প্রীতির প্রচার:',
          des: 'সংগঠনটি হিন্দু সম্প্রদায়ের মধ্যে ঐক্য ও সম্প্রীতির বার্তা ছড়িয়ে দিতে কাজ করে। বিভিন্ন অনুষ্ঠান এবং সভার মাধ্যমে সংগঠনের সদস্যরা একে অপরের সাথে সম্পর্ক উন্নয়ন করে এবং একসাথে সমাজের উন্নয়নে কাজ করে।',
        },
        {
          option: '৬. ধর্মীয় উন্নয়নের জন্য লক্ষ্য ও প্রচার:',
          des: 'সংগঠনটি ধর্মীয় উন্নয়নের জন্য লক্ষ্য ও হিন্দু ধর্মীয় ও সাংস্কৃতিক ঐতিহ্য সংরক্ষণে এবং সমাজের উন্নয়নে গুরুত্বপূর্ণ ভূমিকা পালন করে',
        },
  ];




  return (
    <div className="container-about">
      <div className="about-content">
        <h1 className="our-name">Mohishaban Hindu Society</h1>
        <p className="our-discription">
          **মহিষাবান হিন্দু সোসাইটি** একটি হিন্দু সমাজভিত্তিক সংগঠন যা ধর্মীয়,
          সাংস্কৃতিক ও সামাজিক উন্নয়নের জন্য প্রতিষ্ঠিত হয়েছে। এই সংগঠনটি
          হিন্দু সম্প্রদায়ের ঐতিহ্য, ধর্মীয় আচার-অনুষ্ঠান, এবং সংস্কৃতিকে
          সংরক্ষণ ও প্রচার করার লক্ষ্যে কাজ করে। মহিষাবন হিন্দু সোসাইটি তাদের
          সদস্যদের মধ্যে ঐক্য ও সম্প্রীতির বার্তা ছড়িয়ে দিতে সচেষ্ট এবং
          বিভিন্ন সামাজিক ও ধর্মীয় কার্যক্রমের মাধ্যমে হিন্দু ঐতিহ্যকে সমুন্নত
          রাখার চেষ্টা করে। এছাড়াও, সংগঠনটি ধর্মীয় শিক্ষার প্রচার, বিভিন্ন
          উৎসব ও অনুষ্ঠান উদযাপন, এবং সমাজের দুঃস্থ ও প্রয়োজনীয় মানুষদের
          সাহায্য করার মতো কর্মকাণ্ডে জড়িত থাকে।
        </p>
        <Dropdown title={titleOne} drop={workDes} />
        <Dropdown title={titleTwo} drop={workDesTwo} />
        <Dropdown title={titleThree} drop={privacyPolicy} />
        <Dropdown title={titleFour} drop={committeeElection} />
      </div>
    </div>
  );
};

export default About;